In [3]:
import pandas as pd

path = "../datasets/테스트.xlsx"
path2 = "../datasets/R&E데이터.xlsx"

df = pd.read_excel(path)
df2 = pd.read_excel(path2)

In [5]:
df.columns == df2.columns

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True])

In [7]:
df.head(3)

,순위,선수명,팀명,AVG,G,PA,AB,H,2B,3B,...,HBP,SO,GDP,E,연도,장,R,TB,SAC,SF
0,1,백인천,MBC,0.412,71,298,250,103,23,1,...,3.0,17.0,5.0,0.0,1982,1,NaN,NaN,NaN,NaN
1,2,윤동균,OB,0.342,77,334,284,97,20,5,...,1.0,27.0,3.0,2.0,1982,1,NaN,NaN,NaN,NaN
2,3,장태수,삼성,0.336,66,264,214,72,15,3,...,5.0,33.0,1.0,2.0,1982,1,NaN,NaN,NaN,NaN

In [8]:
df2.head(3)

,순위,선수명,팀명,AVG,G,PA,AB,H,2B,3B,...,HBP,SO,GDP,E,연도,장,R,TB,SAC,SF
0,1,백인천,MBC,0.412,71,298,250,103,23,1,...,3.0,17.0,5.0,0.0,1982,1,NaN,NaN,NaN,NaN
1,2,윤동균,OB,0.342,77,334,284,97,20,5,...,1.0,27.0,3.0,2.0,1982,1,NaN,NaN,NaN,NaN
2,3,장태수,삼성,0.336,66,264,214,72,15,3,...,5.0,33.0,1.0,2.0,1982,1,NaN,NaN,NaN,NaN

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1882 entries, 0 to 1881
Data columns (total 25 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   순위      1882 non-null   int64
 1   선수명     1882 non-null   object
 2   팀명      1882 non-null   object
 3   AVG     1882 non-null   float64
 4   G       1882 non-null   int64
 5   PA      1882 non-null   int64
 6   AB      1882 non-null   int64
 7   H       1882 non-null   int64
 8   2B      1882 non-null   int64
 9   3B      1882 non-null   int64
 10  HR      1882 non-null   int64
 11  RBI     1882 non-null   int64
 12  SB      738 non-null    float64
 13  CS      738 non-null    float64
 14  BB      738 non-null    float64
 15  HBP     738 non-null    float64
 16  SO      738 non-null    float64
 17  GDP     738 non-null    float64
 18  E       738 non-null    float64
 19  연도      1882 non-null   int64
 20  장       1882 non-null   int64
 21  R       1144 non-null   float64
 22  TB      1144 non-null   float64
 23  SAC     1144 non-null   float64
 24  SF      1144 non-null   float64
dtypes: float64(12), int64(11), object(2)
memory usage: 367.7+ KB

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1875 entries, 0 to 1874
Data columns (total 25 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   순위      1875 non-null   int64
 1   선수명     1875 non-null   object
 2   팀명      1875 non-null   object
 3   AVG     1875 non-null   float64
 4   G       1875 non-null   int64
 5   PA      1875 non-null   int64
 6   AB      1875 non-null   int64
 7   H       1875 non-null   int64
 8   2B      1875 non-null   int64
 9   3B      1875 non-null   int64
 10  HR      1875 non-null   int64
 11  RBI     1875 non-null   int64
 12  SB      738 non-null    float64
 13  CS      738 non-null    float64
 14  BB      738 non-null    float64
 15  HBP     738 non-null    float64
 16  SO      738 non-null    float64
 17  GDP     738 non-null    float64
 18  E       738 non-null    float64
 19  연도      1875 non-null   int64
 20  장       1875 non-null   int64
 21  R       1137 non-null   float64
 22  TB      1137 non-null   float64
 23  SAC     1137 non-null   float64
 24  SF      1137 non-null   float64
dtypes: float64(12), int64(11), object(2)
memory usage: 366.3+ KB

In [35]:
cnt = 0
for x in range(len(df2)):
    if not all(df.iloc[x,:].dropna() == df2.iloc[x,:].dropna()):
        cnt += 1
        print(x)
print(cnt)

1703
1704
1705
1706
1707
1708
1709
1710
1711
1712
1713
1714
1715
1716
1717
1718
1719
1720
1721
1722
1723
1724
1725
1726
1727
1728
1729
1730
1731
1732
1733
1734
1735
1736
1737
1738
1739
1740
1741
1742
1743
1744
1745
1746
1747
1748
1749
1750
1751
1752
1753
1754
1755
1756
1757
1758
1759
1760
1761
1762
1763
1764
1765
1766
1767
1768
1769
1770
1771
1772
1773
1774
1775
1776
1777
1778
1779
1780
1781
1782
1783
1784
1785
1786
1787
1788
1789
1790
1791
1792
1793
1794
1795
1796
1797
1798
1799
1800
1801
1802
1803
1804
1805
1806
1807
1808
1809
1810
1811
1812
1813
1814
1815
1816
1817
1818
1819
1820
1821
1822
1823
1824
1825
1826
1827
1828
1829
1830
1831
1832
1833
1834
1835
1836
1837
1838
1839
1840
1841
1842
1843
1844
1845
1846
1847
1848
1849
1850
1851
1852
1853
1854
1855
1856
1857
1858
1859
1860
1861
1862
1863
1864
1865
1866
1867
1868
1869
1870
1871
1872
1873
1874
172

In [34]:
df2.iloc[1874,:].dropna()

순위        43
선수명      김휘집
팀명        NC
AVG    0.232
G         98
PA       347
AB       306
H         71
2B        11
3B         1
HR        12
RBI       36
연도      2025
장          2
R       42.0
TB     120.0
SAC      1.0
SF       0.0
Name: 1874, dtype: object

In [28]:
df.iloc[0,:]

순위         1
선수명      백인천
팀명       MBC
AVG    0.412
G         71
PA       298
AB       250
H        103
2B        23
3B         1
HR        19
RBI       64
SB      11.0
CS       3.0
BB      42.0
HBP      3.0
SO      17.0
GDP      5.0
E        0.0
연도      1982
장          1
R        NaN
TB       NaN
SAC      NaN
SF       NaN
Name: 0, dtype: object